Show / Hide Table of Contents
Class CrossSectionComponentEdges
Cross-section component edges
Inheritance
System.Object
OpenObject
CrossSectionComponentEdges
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.CrossSectionComponentEdges,CI.Loading")]
public class CrossSectionComponentEdges : OpenObject
Constructors
Improve this Doc   View Source
CrossSectionComponentEdges()
Constructor
Declaration
public CrossSectionComponentEdges()
Properties
Improve this Doc   View Source
ComponentIndex
Zero based index of component
Declaration
public int ComponentIndex { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
EdgeIndexes
List of zero based edge indexes of component
Declaration
public List<int> EdgeIndexes { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Int32>
 Improve this Doc
 View Source